//=======================================================
// 
// 誘導する[guide.cpp]
// Author:Rio Ohno
// 
//=======================================================

#include "guide.h"

//グローバル変数宣言
Guide g_Guide;					//誘導構造体

//===============
// 初期化処理
//===============
void InitGuide()
{
	g_Guide.pos = D3DXVECTOR3(0.0f, 0.0f, 0.0f);
	g_Guide.rot = D3DXVECTOR3(0.0f, 0.0f, 0.0f);
	g_Guide.bUse = false;
}

//===============
//終了処理
//===============
void UninitGuide()
{

}

//===============
//更新処理
//===============
void UpdateGuide()
{

}

//================
//描画処理
//================
void DrawGuide()
{

}

//================
//設定処理
//================
void SetGuide()
{

}